# Проверка пароля. Напишите программу авторизации пользователя.
# Правильный пароль Python123 должен быть заранее сохранен в программе.
# Пользователю предоставляется три попытки ввода пароля.
# При правильном вводе программа должна вывести сообщение об успешной авторизации и прекратить работу,
# а после трех неправильных попыток — сообщить о блокировке доступа.

#Logic of the solution
#1 Создать переменную которая будет хранить в себе "Python123";
#2 Создать вторую переменную, которую мы будем заполнять через ввод с клавиатуры;
#3 После ввода программа должны выполнить сравнение двух переменных и выполнить условие:
#   -при правильном вводе программа должна вывести сообщение "авторизация успешна" и прекратить работу.
#   -после трех неправильных попыток вывести сообщение "блокировке доступа".

# solution
