# Анализ чисел. Напишите программу, которая перебирает все числа от 1 до 30.
# Если число делится на 3, программа должна вывести вместо него Bug,
# если делится на 5 - Test, а если одновременно делится на 3 и на 5 - BugTest.
# Во всех остальных случаях необходимо вывести само число.

#Logic of the solution
# 1 Даём перебрать чисел в диапазоне от 1 до 30;
# 2 В момент перебора провести сравнение в соответствии с условиями:
#   -если число делится на 3 - выводим Bug;
#   -если делится на 5 - выводим Test;
#   -если делится на 3 и на 5 - выводим BugTest;
#   -во всех остальных случаях необходимо вывести само число.

# solution